#+TITLE: Emacs Configuration, with org txt: totally awesome ;)
#+AUTHOR: Daniel Mai
#+FORKER: Milan Thapa
#+DESCRIPTION: I customised the for puerly the arch way.

This configuration uses the [[https://github.com/jwiegley/use-package][use-package]] package from John Wiegley, which is a fantastic way to manage package configurations.

Sorry Mai, I have scrambled your configs for sake of mine :D
Since my days with breaking emacs continued since last year 2013, I tried so many options: *g:rhoit* *spacemacs*... long list, but still not satifsfied.. until this awesome youtube url happened. Then everythings changed

Now the changes below are upon [[https://github.com/danielmai/.emacs.d.git][Daniels's fork]]. He seems to be happy mac user :P. So I am customising the emacs the arch way for all emacso archians out there. PS: Maybe I would get sometime/someone do it for others too.

[[https://youtu.be/WZzcEJQ8Hnw?t=48][Enough talk let do it]]


* Installing Emacs

  If you are crazy about the latest-greatest release :like me, please collect it from aur/yaourt.
  #+BEGIN_SRC sh :results drawer
emacs --version
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  GNU Emacs 25.0.50.1
  Copyright (C) 2015 Free Software Foundation, Inc.
  GNU Emacs comes with ABSOLUTELY NO WARRANTY.
  You may redistribute copies of GNU Emacs
  under the terms of the GNU General Public License.
  For more information about these matters, see the file named COPYING.
  :END:

  #+begin_src sh
  echo "I prefer emacs installation from git :D, & I ain't mac user"
  #+end_src

* Font

  [[http://levien.com/type/myfonts/inconsolata.html][Inconsolata]] is a nice monospaced font.

  Pull it with pacman. 
  #+begin_src sh :tangle no :results drawer
yes 'y' | sudo pacman -S ttf-inconsolata
  #+end_src

  #+RESULTS:
  :RESULTS:
  resolving dependencies...
  looking for conflicting packages...

  Packages (1) ttf-inconsolata-20090215-5

  Total Installed Size:  0.10 MiB
  Net Upgrade Size:      0.00 MiB

  checking keyring...
  checking package integrity...
  loading package files...
  checking for file conflicts...
  checking available disk space...
  reinstalling ttf-inconsolata...
  Updating font cache... done.
  :END:

  And here's how we tell Emacs to use the font we want to use.

  #+begin_src emacs-lisp
(add-to-list 'default-frame-alist
             '(font . "Inconsolata-20"))
  #+end_src

** Gitwatcher
   track changes and push file changes with git
   #+BEGIN_SRC emacs-lisp
(defvar autocomit-dir-set '()
  "Set of directories for which there is a pending timer job")

(defun autocommit-schedule-commit (dn)
  "Schedule an autocommit (and push) if one is not already scheduled for the given dir."
  (if (null (member dn autocommit-dir-set))
      (progn
        (run-with-idle-timer
         10 nil
         (lambda (dn)
           (setq autocommit-dir-set (remove dn autocommit-dir-set))
           (message (concat "Committing org files in " dn))
           (shell-command (concat "cd " dn " && git commit -m 'Updated org files.'"))
           (shell-command (concat "cd " dn " && git push & /usr/bin/true"))
           (run-hooks 'dustin-autocommit-hooks))
         dn)
        (setq autocommit-dir-set (cons dn autocommit-dir-set)))))

(defun autocommit-after-save-hook ()
  "After-save-hook to 'git add' the modified file and schedule a commit and push in the idle loop."
  (let ((fn (buffer-file-name)))
    (message "git adding %s" fn)
    (shell-command (concat "git add " fn))
    (autocommit-schedule-commit (file-name-directory fn))))

(defun autocommit-setup-save-hook ()
  "Set up the autocommit save hook for the current file."
  (interactive)
  (message "Set up autocommit save hook for this buffer.")
  (add-hook 'after-save-hook 'autocommit-after-save-hook nil t))

;;
;; Integration
;;

(defun dustin-visiting-a-file ()
  (let* ((fn (buffer-file-name))
         (dn (file-name-directory fn)))
    (if (equal dn (expand-file-name "~/org/"))
        (progn
          (message "Setting up local hook for %s (in %s)"
                   (file-name-nondirectory fn) dn)
          (autocommit-setup-save-hook)
          (add-hook 'dustin-autocommit-hooks 'org-mobile-push)))))

(add-hook 'find-file-hook 'dustin-visiting-a-file)

   #+END_SRC

   #+RESULTS:
   | dustin-visiting-a-file | #[0 \302\301!\210\303\304!8\211\207 [buffer-file-name auto-revert-tail-pos make-local-variable 7 file-attributes] 3] | git-commit-setup-check-buffer | projectile-global-mode-check-buffers | global-undo-tree-mode-check-buffers | undo-tree-load-history-hook | smartparens-global-mode-check-buffers | yas-global-mode-check-buffers | recentf-track-opened-file | global-visual-line-mode-check-buffers | global-font-lock-mode-check-buffers | epa-file-find-file-hook | vc-refresh-state |

